app/controllers/api/v1/users/registrations_controller.rb

        def create
          user = User.new(sign_up_params)
          if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "admin") VALUES ('daybreaker@gmail.com', '$2a$12$9t9Qim7VtorfRlG1z/IUNO.jFSC42DpJQzKbEk/sJZiZxvmUVVaDW', NULL, NULL, NULL, '2025-11-16 03:17:46.810204', '2025-11-16 03:17:46.810204', FALSE) RETURNING "id"