app/controllers/api/v1/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'daybreaker@gmail.com' ORDER BY "users"."id" ASC LIMIT 1
---
        def create
          email = params.dig(:user, :email).to_s
          password = params.dig(:user, :password).to_s

          # Devise's DB auth lookup (respects case-insensitive keys)
          resource = User.find_for_database_authentication(email: email)